{
  "kind": "build_request",
  "title": "Fix production white screen by providing ThemeProvider and adding a safe runtime fallback",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Fix the all-browser white screen by ensuring the React tree includes `ThemeProvider` before any component calls `useTheme` (e.g., `ThemeToggle`). Update the app composition (without modifying immutable files) so that `ThemeToggle` no longer throws `useTheme must be used within a ThemeProvider` at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "はい、直してください"
        ]
      },
      "acceptanceCriteria": [
        "In production, the app renders instead of a blank white screen in multiple browsers.",
        "No runtime error is thrown for missing ThemeProvider (e.g., no `useTheme must be used within a ThemeProvider` error).",
        "Theme toggle functions correctly (switches light/dark and updates UI)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add a user-friendly top-level error boundary (or equivalent global runtime error handling) so that if any unexpected rendering error occurs, users see an English fallback message instead of a blank page, and the underlying error is logged to the console for debugging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "はい、直してください"
        ]
      },
      "acceptanceCriteria": [
        "If a render-time exception occurs, the UI shows an English fallback state rather than a blank screen.",
        "The original error is logged to the browser console with enough detail to diagnose the issue (error message + stack if available)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under the frontend immutable paths list (notably `frontend/src/main.tsx`, `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, and `frontend/src/components/ui/*`).",
    "Keep the backend single-actor architecture unchanged; no backend changes are required for this fix unless a frontend dependency is proven to require it."
  ],
  "nonGoals": [
    "Changing the visual theme, copy, or adding new product features beyond fixing the blank screen and adding a minimal fallback error UI.",
    "Introducing new authentication methods or external services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}