{
  "kind": "build_request",
  "title": "Add Dark Mode toggle with persisted theme preference",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Implement a theme system that supports Light and Dark modes by toggling the `dark` class on the root document element, using Tailwind’s class-based dark mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ダークモードもほしい"
        ]
      },
      "acceptanceCriteria": [
        "When Dark mode is enabled, the app renders using the `.dark { ... }` CSS variables defined in `frontend/src/index.css` (e.g., background, foreground, card colors visibly change).",
        "When Dark mode is disabled, the app renders using the `:root { ... }` CSS variables defined in `frontend/src/index.css`.",
        "The theme application works across the entire app (header, counter card, instructions, footer)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a user-facing theme toggle control in the header (near the existing language selector) that lets the user switch between Light and Dark modes at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ダークモードほしい"
        ]
      },
      "acceptanceCriteria": [
        "A clickable control is present in the header that toggles between Light and Dark modes without a page reload.",
        "The toggle uses existing UI components (e.g., Shadcn `Button` and an icon) and matches the current design quality level.",
        "Any user-visible label/tooltip text introduced for the toggle is sourced from the i18n layer (English and Japanese translations added)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Persist the user’s theme choice locally and restore it on subsequent visits; when no preference is saved, choose a sensible default (prefer the OS color scheme if available).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "お願いします"
        ]
      },
      "acceptanceCriteria": [
        "After selecting Dark mode and refreshing the page, Dark mode remains enabled.",
        "After selecting Light mode and refreshing the page, Light mode remains enabled.",
        "If there is no saved theme preference, the initial theme follows `prefers-color-scheme` (dark -> Dark mode, otherwise Light mode)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose these components instead).",
    "Do not modify any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "All new user-facing strings must be added to the existing i18n dictionaries and referenced via `useI18n()`/translations (English + Japanese)."
  ],
  "nonGoals": [
    "Do not change backend canister logic (Motoko) for this request.",
    "Do not redesign the app’s overall layout beyond what is necessary to add a theme toggle.",
    "Do not add third-party theming libraries."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}