{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore production rendering by adding ThemeProvider and a global error boundary fallback",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Ensure ThemeProvider wraps the React tree before any useTheme usage and add a safe fallback to prevent runtime crashes.",
      "acceptanceCriteria": [
        "In production, the app renders instead of a blank white screen in multiple browsers.",
        "No runtime error is thrown for missing ThemeProvider (e.g., no `useTheme must be used within a ThemeProvider` error).",
        "Theme toggle functions correctly (switches light/dark and updates UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the existing app content with ThemeProvider so components like ThemeToggle (which call useTheme) are always rendered within a ThemeProvider. Keep changes within App.tsx (do not modify immutable frontend/src/main.tsx)."
        },
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "modify",
          "description": "Add a defensive runtime fallback so that if ThemeContext is unexpectedly missing, the hook does not crash the entire render tree; instead it should log a clear console error and return a safe default theme state (e.g., light + no-op setters) to keep the UI rendering."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add a top-level error boundary so unexpected render errors show an English fallback UI and log details to the console.",
      "acceptanceCriteria": [
        "If a render-time exception occurs, the UI shows an English fallback state rather than a blank screen.",
        "The original error is logged to the browser console with enough detail to diagnose the issue (error message + stack if available)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppErrorBoundary.tsx",
          "operation": "create",
          "description": "Create a React error boundary component that catches render-time exceptions, logs the error (message + stack if available) to the browser console, and renders a minimal English fallback message (optionally with a refresh action)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire AppErrorBoundary at the top of the App composition (wrapping ThemeProvider/I18nProvider/AppContent as appropriate) so any unexpected rendering error results in the fallback UI instead of a blank page."
        }
      ]
    }
  ]
}